notes/d.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2021-10-12 Tue 15:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>D言語のTips</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shigeki Karita" />
<link rel="stylesheet" type="text/css" href="/css/org.css"/>
 <link href="/css/code.css" rel="stylesheet">
</head>
<body>
<div id="content">
<h1 class="title">D言語のTips</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge93c3bd">1. 型全般</a>
<ul>
<li><a href="#org9fe6eec">1.1. 関数の中で自身の戻り値型を取得する</a></li>
<li><a href="#org9ea44c2">1.2. 特定のコードが動作するか検査する型制約を書く</a></li>
</ul>
</li>
<li><a href="#org5672d58">2. モジュール</a>
<ul>
<li><a href="#orgb5a6a0c">2.1. モジュール内の関数・変数を調べる</a></li>
</ul>
</li>
<li><a href="#org00700a2">3. コンパイラ</a>
<ul>
<li><a href="#org082bace">3.1. LDCでbetterCモード</a></li>
<li><a href="#org2731b06">3.2. コンパイル時ファイル読み込み</a></li>
</ul>
</li>
<li><a href="#orgac4d45f">4. 関数仮引数における修飾子</a>
<ul>
<li><a href="#orgf833664">4.1. 右辺値の扱い</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="abstract" id="org73c2a84">
<div class="org-center">
<p>
忘れやすい簡単なイディオム集
</p>
</div>

</div>

<div id="outline-container-orge93c3bd" class="outline-2">
<h2 id="orge93c3bd"><span class="section-number-2">1.</span> 型全般</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9fe6eec" class="outline-3">
<h3 id="org9fe6eec"><span class="section-number-3">1.1.</span> 関数の中で自身の戻り値型を取得する</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<code>typeof(return)</code> を使う．
例えばmixin先の関数の中で戻り値型が欲しいことがある．
</p>

<div class="org-src-container">
<pre class="src src-d"><span class="org-keyword">import</span> <span class="org-constant">std</span>.<span class="org-constant">stdio</span>;

<span class="org-keyword">mixin</span> <span class="org-keyword">template</span> <span class="org-type">isVoid</span>(<span class="org-type">string</span> <span class="org-variable-name">fname</span> = __FUNCTION__) {
    <span class="org-keyword">alias</span> <span class="org-variable-name">Ret</span> = <span class="org-keyword">typeof</span>(<span class="org-keyword">return</span>);
    <span class="org-keyword">enum</span> <span class="org-variable-name">isVoid</span> = <span class="org-keyword">is</span>(Ret == <span class="org-type">void</span>);

    <span class="org-type">void</span> <span class="org-function-name">f</span>() {
        <span class="org-keyword">if</span> (isVoid) {
            writeln(fname ~ <span class="org-string">" returns void"</span>);
        } <span class="org-keyword">else</span> {
            writeln(fname ~ <span class="org-string">" does not return void"</span>);
        }
    }
}

<span class="org-type">int</span> <span class="org-function-name">foo</span>() {
    <span class="org-keyword">mixin</span> isVoid;
    f();
    <span class="org-keyword">return</span> 1;
}

<span class="org-type">void</span> <span class="org-function-name">main</span>() {
    foo();

    <span class="org-keyword">mixin</span> isVoid;
    f();

<span class="org-comment-delimiter">/* </span><span class="org-comment">&#23455;&#34892;&#32080;&#26524; https://wandbox.org/permlink/r9uG53ygmStEagBS</span>
<span class="org-comment">prog.foo does not return void</span>
<span class="org-comment">prog.main returns void</span>
<span class="org-comment-delimiter">*/</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9ea44c2" class="outline-3">
<h3 id="org9ea44c2"><span class="section-number-3">1.2.</span> 特定のコードが動作するか検査する型制約を書く</h3>
<div class="outline-text-3" id="text-1-2">
<p>
別にどう書いても良いが，C++のConcept (requires-expression) と同じパターンがある．
</p>

<ul class="org-ul">
<li>C++ Concepts（P0734R0） <a href="http://d.hatena.ne.jp/yohhoy/20170904/p1">http://d.hatena.ne.jp/yohhoy/20170904/p1</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-d"><span class="org-keyword">import</span> <span class="org-constant">std</span>.<span class="org-constant">stdio</span>;

<span class="org-keyword">enum</span> <span class="org-type">bool</span> <span class="org-function-name">isAddable</span>(<span class="org-type">T</span>) = <span class="org-keyword">is</span>(<span class="org-keyword">typeof</span>((<span class="org-type">T</span> <span class="org-variable-name">a</span>, <span class="org-type">T</span> <span class="org-variable-name">b</span>){
    <span class="org-comment-delimiter">// </span><span class="org-comment">T &#12364; Addable &#12394;&#12425;&#12467;&#12531;&#12497;&#12452;&#12523;&#12391;&#12365;&#12427;&#12399;&#12378;&#12394;&#12467;&#12540;&#12489;&#12434;&#26360;&#12367;</span>
    <span class="org-keyword">auto</span> <span class="org-variable-name">c</span> = a + b;
    ++a;
}));


<span class="org-type">void</span> <span class="org-function-name">main</span>() {
    <span class="org-keyword">static</span> <span class="org-keyword">assert</span>(isAddable<span class="org-negation-char">!</span><span class="org-type">int</span>);
    <span class="org-keyword">static</span> <span class="org-keyword">assert</span>(<span class="org-negation-char">!</span>ocaml.isAddable<span class="org-negation-char">!</span><span class="org-type">string</span>);
}
</pre>
</div>

<p>
仕組みはこちらの解説がわかりやすい <a href="http://www.codelogy.org/entry/2012/08/12/120835">http://www.codelogy.org/entry/2012/08/12/120835</a>
</p>
</div>
</div>
</div>


<div id="outline-container-org5672d58" class="outline-2">
<h2 id="org5672d58"><span class="section-number-2">2.</span> モジュール</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgb5a6a0c" class="outline-3">
<h3 id="orgb5a6a0c"><span class="section-number-3">2.1.</span> モジュール内の関数・変数を調べる</h3>
<div class="outline-text-3" id="text-2-1">
<p>
例えばPhobosで最近追加された関数が使えるか，バージョンを調べるのが面倒・ハードコードしたくないときに使う．
<code>std.traits.hasMember</code> はモジュールを引数に取れないので注意・
</p>

<div class="org-src-container">
<pre class="src src-d"><span class="org-keyword">import</span> <span class="org-constant">std</span>.<span class="org-constant">stdio</span>;
<span class="org-keyword">import</span> <span class="org-constant">std</span>.<span class="org-constant">algorithm</span>;

<span class="org-keyword">static</span> <span class="org-keyword">if</span>(<span class="org-negation-char">!</span><span class="org-keyword">__traits</span>(<span class="org-constant">hasMember</span>, std.algorithm, <span class="org-string">"minIndex"</span>)) {
    <span class="org-comment-delimiter">// </span><span class="org-comment">2.069 &#12392;&#12363;&#12391;&#12399;&#12371;&#12385;&#12425;&#12364;&#20351;&#12431;&#12428;&#12427;</span>
    <span class="org-keyword">auto</span> <span class="org-function-name">minIndex</span>(<span class="org-type">R</span>)(<span class="org-type">R</span> <span class="org-variable-name">x</span>) {
        <span class="org-keyword">return</span> 0;
    }
}

<span class="org-type">void</span> <span class="org-function-name">main</span>() {
    [100,1,2,3].minIndex.writeln;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org00700a2" class="outline-2">
<h2 id="org00700a2"><span class="section-number-2">3.</span> コンパイラ</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org082bace" class="outline-3">
<h3 id="org082bace"><span class="section-number-3">3.1.</span> LDCでbetterCモード</h3>
<div class="outline-text-3" id="text-3-1">
<p>
DMDのbetterCというのはDの標準ライブラリPhobosやRuntimeをリンクしないバイナリを作るオプションである．LDCでは
</p>

<ul class="org-ul">
<li>コードに <code>version(LDC) pragma(LDC_no_moduleinfo);</code> と書く</li>
<li>コンパイラに <code>-relocation-model=static</code> フラグを付ける</li>
</ul>

<p>
これで他のCコードとリンクするときに使っていないライブラリやRuntimeがないと怒られなくなる．
ちなみにDMDは2.076.0までのバージョンではきちんと依存を外してくれないので注意． <a href="https://dlang.org/blog/2017/08/23/d-as-a-better-c/">https://dlang.org/blog/2017/08/23/d-as-a-better-c/</a>
</p>
</div>
</div>

<div id="outline-container-org2731b06" class="outline-3">
<h3 id="org2731b06"><span class="section-number-3">3.2.</span> コンパイル時ファイル読み込み</h3>
<div class="outline-text-3" id="text-3-2">
<p>
コンパイラオプションで，-J でファイルのパスを指定し， <code>import("ファイル名")</code> で読み込める．
例えば簡単にQuineを書きたいとか（反則），コンパイル時にCヘッダーをパースしてD言語に変換したいときに使う．
</p>

<div class="org-src-container">
<pre class="src src-d"><span class="org-keyword">import</span> <span class="org-constant">std</span>.<span class="org-constant">stdio</span>;

<span class="org-type">void</span> <span class="org-function-name">main</span>() {
    <span class="org-keyword">auto</span> <span class="org-variable-name">f</span> = <span class="org-keyword">import</span>(<span class="org-string">"prog.d"</span>);
    f.writeln; <span class="org-comment-delimiter">// </span><span class="org-comment">&#12371;&#12398;&#12467;&#12540;&#12489;&#12364;&#20986;&#21147;&#12373;&#12428;&#12427;&#65294;</span>
}
</pre>
</div>

<p>
<a href="https://wandbox.org/permlink/VvR7h4AIReRVpXBe">https://wandbox.org/permlink/VvR7h4AIReRVpXBe</a>
</p>

<ul class="org-ul">
<li>コンパイル時にCヘッダーをパースしてenumをmixinするコード <a href="https://github.com/ShigekiKarita/d-nv/blob/7946c12c5657d0a9e73167792d1565f2f1474e86/source/dnv/error.d#L28">https://github.com/ShigekiKarita/d-nv/blob/7946c12c5657d0a9e73167792d1565f2f1474e86/source/dnv/error.d#L28</a></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgac4d45f" class="outline-2">
<h2 id="orgac4d45f"><span class="section-number-2">4.</span> 関数仮引数における修飾子</h2>
<div class="outline-text-2" id="text-4">
<p>
C++ の修飾子 (qualifier) といえば， const, volatile くらいでした．Effective C++などで推奨されているスタイルとしては
</p>

<ol class="org-ol">
<li>とりあえずconst修飾できるならする</li>
<li>コピーコストが大きい型は参照(&amp;)かポインタ(*)に修飾</li>
<li>右辺値参照も左辺値参照も共通の関数でオーバーロードしたいならユニバーサル参照 (T&amp;&amp;) に修飾</li>
</ol>

<p>
くらいの気持ちで良かったと思いますが，D言語には修飾子がたくさんあります．
</p>

<ul class="org-ul">
<li>本家 <a href="https://dlang.org/spec/function.html#parameters">https://dlang.org/spec/function.html#parameters</a></li>
<li>昔の日本語訳 <a href="http://www.kmonos.net/alang/d/function.html">http://www.kmonos.net/alang/d/function.html</a></li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">&#34920;1:</span> 仮引数の記憶域クラス</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">記憶域クラス</th>
<th scope="col" class="org-left">説明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">修飾なし</td>
<td class="org-left">仮引数は実引数の書き換え可能なコピーとなる (*)</td>
</tr>

<tr>
<td class="org-left">in</td>
<td class="org-left">規格上はconst scope と同じとして定義されるが， <b>現在の実装ではconstと同じなので，const scopeを使うべき．</b></td>
</tr>

<tr>
<td class="org-left">out</td>
<td class="org-left">仮引数は関数に入る際に、 その型のデフォルト値で初期化される</td>
</tr>

<tr>
<td class="org-left">ref</td>
<td class="org-left">引数は参照渡しされる</td>
</tr>

<tr>
<td class="org-left">scope</td>
<td class="org-left">仮引数への参照は関数スコープの外に出すこと (グローバル変数への代入など) はできない</td>
</tr>

<tr>
<td class="org-left">lazy</td>
<td class="org-left">実引数は呼び出し側ではなく、呼ばれた関数の中で使った時に評価される</td>
</tr>

<tr>
<td class="org-left">const</td>
<td class="org-left">実引数が暗黙にconst型に変換される</td>
</tr>

<tr>
<td class="org-left">immutable</td>
<td class="org-left">実引数が暗黙にimmutable型に変換される</td>
</tr>

<tr>
<td class="org-left">shared</td>
<td class="org-left">実引数が暗黙にshared型に変換される</td>
</tr>

<tr>
<td class="org-left">inout</td>
<td class="org-left">実引数が暗黙にinout型に変換される</td>
</tr>
</tbody>
</table>

<p>
(*) 動的配列と(クラス型の)オブジェクトは参照として渡され，in/out/ref修飾は参照に適用され，中身の値には適用されない．
</p>
</div>

<div id="outline-container-orgf833664" class="outline-3">
<h3 id="orgf833664"><span class="section-number-3">4.1.</span> 右辺値の扱い</h3>
<div class="outline-text-3" id="text-4-1">
<p>
ここで，気になるのがC++でいう右辺値のようなコピー禁止な値をどうやって受けるかということです (ref refみたいな型は無い)．
</p>


<ol class="org-ol">
<li>とりあえず immutable または const 修飾できるならする</li>
<li>とりあえずコピーコストが大きい型は参照 (ref) にして， scope 修飾できるならする</li>
<li>mutable, const, immutable な値も共通の関数でオーバーロードしたいならinoutに修飾</li>
<li>必要なら out をつける</li>
<li>マルチスレッド間で共有が必要なら shared をつける</li>
<li>必要なら lazy をつける (例えば logging みたいな，場合によって評価しないコードなど)</li>
</ol>

<p>
ついでに関数の属性・アノテーションも pure, nothrow, @nogc, @safe (または@trusted) をつけまくるべきです．
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: Shigeki Karita</p>
<p class="date">Created: 2021-10-12 Tue 15:32</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.2 (<a href="https://orgmode.org">Org</a> mode 9.4.4)</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
